
DAYS = [
    'нулевое',
    'первое',
    'второе',
    'третье',
    'четвёртое',
    'пятое',
    'шестое',
    'седьмое',
    'восьмое',
    'девятое',
    'десятое',
    'одиннадцатое',
    'двенадцатое',
    'тринадцатое',
    'четырнадцатое',
    'пятнадцатое',
    'шестнадцатое',
    'семнадцатое',
    'восемнадцатое',
    'девятнадцатое',
    'двадцатое',
    'двадцать первое',
    'двадцать второе',
    'двадцать третье',
    'двадцать четвертое',
    'двадцать пятое',
    'двадцать шестое',
    'двадцать седьмое',
    'двадцать восьмое',
    'двадцать девятое',
    'тридцатое',
    'тридцать первое'
]

MONTHS = [
    '',
    'января',
    'февраля',
    'марта',
    'апреля',
    'мая',
    'июня',
    'июля',
    'августа',
    'сентября',
    'октября',
    'ноября',
    'декабря',
]

HOURS = {
    'singular': 'час',
    'plural': 'часов',
    'plural_alt': 'часа'
}

MINUTES = {
    'singular': 'минута',
    'plural': 'минут',
    'plural_alt': 'минуты'
}

SECONDS = {
    'singular': 'секунда',
    'plural': 'секунд',
    'plural_alt': 'секунды'
}

THOUSANDS = {
    'singular': 'тысяча',
    'plural': 'тысяч',
    'plural_alt': 'тысячи',
}

NUMBERS = [
    '',
    {'fem': 'одна', 'mus': 'один'},
    {'fem': 'две', 'mus': 'два'},
    'три',
    'четыре',
    'пять',
    'шесть',
    'семь',
    'восемь',
    'девять',
]

HUNDREDS = [
    ''
    "",
    'сто',
    'двести',
    'триста',
    'четыреста',
    'пятьсот',
    'шестьсот',
    'семьсот',
    'восемьсот',
    'девятьсот',
]

TENS = [
    '',
    'десять',
    'двадцать',
    'тридцать',
    'сорок',
    'пятьдесят',
    'шестьдесят',
    'семьдесят',
    'восемьдесят',
    'девяносто',
]

TEN_ROUNDS = [
    ''
    'десятого',
    'двадцатого',
    'тридцатого',
    'сорокового',
    'пятидесятого',
    'шестидесятого',
    'семидесятого',
    'восьмидесятого',
    'девяностого',
]

YEAR_ENDS = [
    'нулевого',
    'первого',
    'второго',
    'третьего',
    'четвёртого',
    'пятого',
    'шестого',
    'седьмого',
    'восьмого',
    'девятого',
]

TENTH = {
    11: 'одиннадцать',
    12: 'двенадцать',
    13: 'тринадцать',
    14: 'четырнадцать',
    15: 'пятнадцать',
    16: 'шестнадцать',
    17: 'семнадцать',
    18: 'восемнадцать',
    19: 'девятнадцать',
}

YEAR_PREFIXES = [
    '',
    '',
    'двух',
    'трёх',
    'четырёх',
    'пяти',
    'шести',
    'семи',
    'восьми',
    'девяти',
]
